## 1. RDBMS(Relational Database Management System) 이해

### 1.1 데이터베이스란?
 - 체계화된 데이터의 모임
 - 여러 응용 시스템들의 통합된 정보를 저장하여, 운영할 수 있는 공용 데이터의 묶음
 - 논리적으로 연관된 하나 이상의 자료 모음으로, 데이터를 고도로 구조화함으로써 검색/갱신등의 데이터 관리를 효율화함
 - DBMS: 데이터베이스를 관리하는 시스템
 <br><br>
 - 데이터베이스 장점
   1. 데이터 중복 최소화
   2. 데이터 공유
   3. 일관성, 무결성, 보안성 유지
   4. 최신의 데이터 유지
   5. 데이터의 표준화 가능
   6. 데이터의 논리적, 물리적 독립성
   7. 용이한 데이터 접근
   8. 데이터 저장 공간 절약
 <br><br>
 - 데이터베이스 단점
   1. 데이터베이스 전문가 필요
   2. 많은 비용 부담
   3. 시스템의 복잡함
   
 - 데이터베이스 랭킹 (Oct. 2017)
 <img src="https://www.fun-coding.org/00_Images/db_types.png" /><br>
 출처: https://db-engines.com/en/ranking

### 1.2 RDBMS(Relational Database Management System, 관계형 데이터베이스 관리 시스템)
 
 - 데이터베이스의 한 종류로, 가장 많이 사용됨
 - 역사가 오래되어, 가장 신뢰성이 높고, 데이터 분류, 정렬, 탐색 속도가 빠름
 <br><br>
 - 관계형 데이터베이스 = 테이블!
 - 2차원 테이블(Table) 형식을 이용하여 데이터를 정의하고 설명하는 데이터 모델
 - 관계형 데이터베이스에서는 데이터를 속성(Attribute)과 데이터 값(Attribute Value)으로 구조화(2차원 Table 형태로 만들어짐)
 - 데이터를 구조화한다는 것은 속성(Attribute)과 데이터 값(Attribute Value) 사이에서 관계(Relation)을 찾아내고 이를 테이블 모양의 구조로 도식화함의 의미함
 - 주요 용어
 <img src="https://www.fun-coding.org/00_Images/rdbms_term1.png" />
   - Primary Key and Foreign Key
     - Primary Key(기본키): Primary Key는 한 테이블(Table)의 각 로우(Row)를 유일하게 식별해주는 컬럼(Column)으로, <br>
       각 테이블마다 Primary Key가 존재해야 하며, NULL 값을 허용하지 않고, 각 로우(Row)마다 유일한 값이어야 한다.
     - Foreign Key(외래키 또는 외부키): Foreign Key는 한 테이블의 필드(Attribute) 중 다른 테이블의 행(Row)을 식별할 수 있는 키
 <img src="https://www.fun-coding.org/00_Images/rdbms_keys.png" />

### 1.3 데이터베이스 스키마(Schema)
 
 - 데이터베이스의 테이블 구조 및 형식, 관계 등의 정보를 형식 언어(formal language)로 기술한 것
   1. 관계형 데이터베이스를 사용하여 데이터를 저장할 때 가장 먼저 할 일은 데이터의 공통 속성을 식별하여 컬럼(Column)으로 정의하고, 테이블(Table)을 만드는 것
   2. 통상적으로 하나의 테이블이 아닌 여러 개의 테이블로 만들고, 각 테이블 구조, 형식, 관계를 정의함
   3. 이를 스키마라고 하며, 일종의 데이터베이스 설계도로 이해하면 됨
   4. 데이터베이스마다 스키마를 만드는 언어가 존재하며, 해당 스키마만 있으면 동일한 구조의 데이터베이스를 만들 수 있음<br>
      (데이터베이스 백업과는 달리 데이터 구조만 동일하게 만들 수 있음)
 <img src="https://www.fun-coding.org/00_Images/schema.png" />

### 1.4 SQL(Structured Query Language)
 
 - 관계형 데이터베이스 관리 시스템에서 데이터를 관리하기 위해 사용되는 표준 프로그래밍 언어(Language)
 - 데이터베이스 스키마 생성 및 수정, 테이블 관리, 데이터 추가, 수정, 삭제, 조회 등, 데이터베이스와 관련된 거의 모든 작업을 위해 사용되는 언어
 - 데이터베이스마다 문법에 약간의 차이가 있지만, 표준 SQL을 기본으로 하므로, 관계형 데이터베이스를 다루기 위해서는 필수적으로 알아야 함
 - SQL은 크게 세 가지 종류로 나뉨
   - 데이터 정의 언어(DDL, Data Definition Language)
   - 데이터 처리 언어(DML, Data Manipulation Language)
   - 데이터 제어 언어(DCL, Data Control Language)
 
#### 1.4.1 데이터 정의 언어(DDL, Data Definition Language): 데이터 구조 정의
 - 테이블(TABLE), 인덱스(INDEX) 등의 개체를 만들고 관리하는데 사용되는 명령
 - CREATE, ALTER, DROP 등이 있음
 
#### 1.4.2 데이터 조작 언어(DML, Data Manipulation Language): 데이터 CRUD [Create(생성), Read(읽기), Update(갱신), Delete(삭제)]
 - INSERT	테이블(Table)에 하나 이상의 데이터 추가.
 - UPDATE	테이블(Table)에 저장된 하나 이상의 데이터 수정.
 - DELETE	테이블(Table)의 데이터 삭제.
 - SELECT	테이블(Table)에 저장된 데이터 조회.
 
#### 1.4.2 데이터 제어 언어(DCL, Data Control Language): 데이터 핸들링 권한 설정, 데이터 무결성 처리 등 수행
 - GRANT	데이터베이스 개체(테이블, 인덱스 등)에 대한 사용 권한 설정.
 - BEGIN	트랜잭션(Transaction) 시작.
 - COMMIT	트랜잭션(Transaction) 내의 실행 결과 적용.
 - ROLLBACK	트랜잭션(Transaction)의 실행 취소.

## 2. MySQL 이해 및 실습 
 - MySQL(마이에스큐엘)은 세계에서 가장 많이 쓰이는 오픈 소스 관계형 데이터베이스 관리 시스템
 - MySQL는 오라클사가 소유. 불확실한 라이선스 정책으로 인해, 동일 소스를 기반으로 MariaDB 가 파생됨 (거의 유사, MariaDB가 오픈소스 라이센스를 따르고 있다고 보면 됨)

<div class="alert alert-block alert-success">
<font color="blue" size="4em">2.1 MySQL 설치 - 실습1</font><br>
   1. sudo apt-get update<br>
   2. sudo apt-get install mysql-server<br>
   3. mysql_secure_installation<br>
      - 비밀번호 설정 필요<br>
      - 참고: 만약 vi 명령이 없다면, 다음과 같이 vi 설치 및 사용법 숙지<br>
        - sudo apt-get install vim<br>
   3. sudo vim /etc/mysql/mysql.conf.d/mysqld.cnf <br>
     - 다음 설정을 [mysqld] 에 추가<br>
       1. mysql 원격 접속 허용<br>
          - bind-address 0.0.0.0 로 변경<br>
       2. mysql 한글 설정 추가<br>
          - collation-server = utf8_unicode_ci<br>
          - character-set-server = utf8<br>
          - skip-character-set-client-handshake<br>
   4. sudo service mysql start<br>
     - mysql 서비스 시작<br>
 참고:
 <pre>
 Usage: /etc/init.d/mysql start|stop|restart|status
 </pre>
 
   5. 모든 호스트에서 mysql 접속 허용하기<br>
 
 <pre>
 # mysql -u root -p 후 비밀번호 입력
 mysql> use mysql;
 mysql> GRANT ALL PRIVILEGES ON *.* to 'root'@'%' IDENTIFIED BY 'korea123';
 mysql> flush privileges;
 mysql> exit
 # sudo service mysql restart
 </pre>
 </div>

<pre>
/etc/mysql/mysql.conf.d/mysqld.cnf 파일의 [mysqld] 설정 예

[mysqld]
#
# * Basic Settings
#
user            = mysql
pid-file        = /var/run/mysqld/mysqld.pid
socket          = /var/run/mysqld/mysqld.sock
port            = 3306
basedir         = /usr
datadir         = /var/lib/mysql
tmpdir          = /tmp
lc-messages-dir = /usr/share/mysql
skip-external-locking
collation-server = utf8_unicode_ci
character-set-server = utf8
skip-character-set-client-handshake
#
# Instead of skip-networking the default is now to listen only on
# localhost which is more compatible and is not less secure.
bind-address            = 0.0.0.0
</pre>

<pre>
참고1: use mysql;
use 데이터베이스명; 으로 mysql 데이터베이스는 mysql 설정을 저장하고 있는 데이터베이스임. 해당 데이터베이스에서 작업을 하겠다는 의미임.

참고2: mysql 접속 허용 관련 설정 (5장 참고)
1) 로컬에서만 접속 허용
mysql> GRANT ALL PRIVILEGES ON DATABASE.TABLE to 'root'@localhost identified by "korea123";

2) 특정 호스트에만 접속 허용
mysql> GRANT ALL PRIVILEGES ON DATABASE.TABLE to 'root'@www.blim.co.kr identified by "korea123";

3) 모든 호스트에서 접속 허용
mysql> GRANT ALL PRIVILEGES ON DATABASE.TABLE to 'root'@'%' identified by "korea123";

옵션 상세
(1) ALL – 모든 권한 / SELECT, UPDATE – 조회, 수정 권한등으로 권한 제한 가능
    예) GRANT INSERT,UPDATE,SELECT ON *.* TO 'username'@'localhost' IDENTIFIED BY '비밀번호';
(2) database.table – 특정 데이터베이스에 특정 테이블에만 권한을 줄 수 있음 / *.* – 모든 데이터베이스에 모든 테이블 권한을 가짐
(3) root – 계정명
(4) korea123 – 계정 비밀번호

참고3: flush privileges; (5장 참고)
- user, db 같은 grant table을 INSERT, UPDATE 등을 써서 직접 데이터 입력/수정을 할 경우, grant tables를 다시 읽어야 권한 설정이 적용됨.
- 서버를 재기동하지 않고, grant table을 새로 읽으라는 명령이 flush privileges 이지만, INSERT, UPDATE 가 아닌 GRANT 명령을 사용했을 경우에는 해당 명령 생략 가능 (하지만 확실하게 하기 위해 일반적으로 사용)
</pre>

<div class="alert alert-block alert-success">
<font color="blue" size="4em">2.2 mysql workbench 설치 - 실습2</font><br>
 - mysql 서버에 접속해서 SQL 명령을 통해, mysql 데이터베이스 조회 및 조작을 할 수 있는 클라이언트 소프트웨어<br>
 - 프로그래머들은 mysql workbench를 사용하기보다는 직접 CLI(Command line interface)를 사용하는 경우가 많음<br>
 - workbench 사용법 및 CLI 사용법 둘다 익혀둘 것<br>
 <br>
 - 다운로드 및 설치: <br>
   - https://dev.mysql.com/downloads/workbench/ 에서 workbench 다운로드<br>
   - 설치 및 mysql 서버 연결 참고, 상세 인터페이스 (https://help.iwinv.kr/manual/read.html?idx=349)<br>
 <br>
 - docker에 mysql 서버를 설치한 경우는 3306 mysql 포트 추가 오픈이 필요함<br>
   - 추가 포트 오픈 방법 <br>
 http://1004jonghee.tistory.com/entry/%EC%BB%A8%ED%85%8C%EC%9D%B4%EB%84%88-%EC%82%AD%EC%A0%9C%ED%95%98%EC%A7%80-%EC%95%8A%EA%B3%A0-%ED%8F%AC%ED%8A%B8-%EC%B6%94%EA%B0%80%ED%95%98%EA%B8%B0![image.png](attachment:image.png)
   <br><br>
   - 예: commit 후 새로운 image로 기존 옵션에 -p 3306:3306 추가해서 docker 실행 <br>
     - docker pull jhleeroot/dave_ubuntu:1.0.1<br>
     - docker run -Pit -i -t -p 8888:8888 -p 8787:8787 -p 8022:22 -p 3306:3306 --name dave_ubuntu jhleeroot/dave_ubuntu:1.0.1 /bin/bash<br>
     - docker ps -a<br>
     - docker restart dave_ubuntu<br>
     - docker attach dave_ubuntu<br>
   - docker 안에서 mysql 처음 시작시 다음 명령 실행<br>
     - sudo usermod -d /var/lib/mysql/ mysql<br>
     - sudo chown -R mysql:mysql /var/lib/mysql /var/run/mysqld<br>
   - sudo service mysql restart
   <br><br>
   - 윈도우10의 경우 workbench 연결 설정의 Hostname을 127.0.0.1 로 하면 접속 성공<br>
   - 맥의 경우 workbench 연결 설정의 Hostname을 0.0.0.0 으로 하면 접속 성공
 </div>

### mysql 접속 명령

<pre>
# mysql -h host -u user -p [password] dbname
  host: mysql 서버 주소 (관련 옵션 사용 안하면, 현재 PC)
  user: mysql ID
  password: mysql ID의 암호

예)
  # mysql -u root -p
  현재 PC에 root ID로 별도 데이터베이스를 지정하지 않고, 접속
</pre>

<div class="alert alert-block alert-success">
<font color="blue" size="4em">실습3 - 데이터베이스, 테이블 목록 보기</font>
<pre>
# mysql -u root -p
# show databases;
# use mysql;
# show tables;
# use information_schema;
# show tables;
# exit
</pre>

참고: https://dev.mysql.com/doc/refman/5.7/en/
</div>

## 3. SQL DDL(Data Definition Language) 이해 및 실습

 ### 3.1 데이터베이스
 
 - 데이터베이스 안에는 여러 개의 데이터베이스 이름이 존재한다.
 - 각 데이터베이스 이름 안에는 여러 개의 테이블이 존재한다.
  <img src="https://www.fun-coding.org/00_Images/db_table.png" />

<pre>
1. 데이터베이스 생성
mysql> CREATE DATABASE dbname;
 
2. 데이터베이스 목록 보기
mysql> SHOW DATABASES;
 
3. dbname 데이터베이스 사용 시
mysql> USE dbname;
 
4. dbname 데이터베이스 삭제
mysql> DROP DATABASE [IF EXISTS] dbname;

IF EXISTS 옵션은 해당 데이타베이스 이름이 없더라도 오류를 발생시키지 말라는 의미
</pre>

* CREATE SCHEMA dbname;
CREATE DATABASE dbname과 동일한 명령임

<div class="alert alert-block alert-success">
<font color="blue" size="4em">실습4 - 데이터베이스 생성, 목록 보기, 사용, 삭제</font><br>
<pre>
mysql> CREATE DATABASE dave;
Query OK, 1 row affected (0.00 sec)

mysql> SHOW DATABASES;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| dave               |
| mysql              |
| performance_schema |
| sys                |
+--------------------+
5 rows in set (0.00 sec)

mysql> USE dave;
Database changed
mysql> DROP DATABASE IF EXISTS dave;
Query OK, 0 rows affected (0.00 sec)

mysql> SHOW DATABASES;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| sys                |
+--------------------+
4 rows in set (0.00 sec)
</pre>
</div>

### 3.2 테이블

#### 3.2.1 테이블 생성
- 기본 문법 (CREATE TABLE 구문)

<pre>
CREATE TABLE 테이블명 (
    컬럼명 데이터형,
    컬러명 데이터형,
    .
    .
    기본키 셋
);
</pre>

1. 테이블을 생성할 데이터베이스를 먼저 사용하겠다고 명령한 후에,
<pre>
mysql> CREATE DATABASE dave;
mysql> use dave;
</pre>
2. 테이블 생성
<pre>
mysql> CREATE TABLE 테이블명 (
    컬럼명 데이터형,
    컬러명 데이터형,
    .
    .
    Primary Key 가 될 필드 지정
);
</pre>

- 숫자 타입의 컬럼 정의 문법
<pre>
mysql> CREATE TABLE dave_table (
    -> id INT [UNSIGNED] [NOT NULL] [AUTO_INCREMENT],
</pre>
<pre>
id : 컬럼명, 가능한 영어 소문자 중심으로 명명
INT : 컬럼에 대한 데이터 타입 선언 (참고4 참조)
[UNSIGNED] : 옵션 사항
             예) TINYINT 로 지정시 -128 ~ +127 
                 TINYINT UNSIGNED 로 지정시 0 ~ 255
[NOT NULL] : NOT NULL 명시하면 데이터 입력시, 해당 컬럼 데이터에 값이 할당되지 않는 경우를 허락하지 않겠다는 의미
[AUTO_INCREMENT] : AUTO_INCREMENT 명시하면, 해당 테이블에 데이터 등록시 해당 컬럼은 자동으로 숫자가 1씩 증가하여 저장됨
                   해당 컬럼은 양의 정수만 등록할 수 있어야 하고, 테이블 안에서 AUTO_INCREMENT 컬럼은 하나만 지정 가능함
</pre>
<img src="https://www.fun-coding.org/00_Images/numeric_column.png" />

- 문자 타입의 컬럼 정의 문법
<pre>
mysql> CREATE TABLE dave_table (
    -> name VARCHAR(50),
</pre>
<pre>
name : 컬럼명, 가능한 영어 소문자 중심으로 명명
VARCHAR(n) : 컬럼에 대한 문자형 데이터 타입 선언 (참고4 참조)
</pre>
<img src="https://www.fun-coding.org/00_Images/string_column.png" />

- 시간 타입의 컬럼 정의 문법
<pre>
mysql> CREATE TABLE dave_table (
    -> ts DATE,
</pre>
<pre>
ts : 컬럼명, 가능한 영어 소문자 중심으로 명명
DATE : 컬럼에 대한 시간 타입 선언
</pre>
<img src="https://www.fun-coding.org/00_Images/date_column.png" />

- Primary Key 가 될 필드 지정 문법
<pre>
mysql> CREATE TABLE dave_table (
    -> 컬럼명 데이터형,
    -> .
    -> PRIMARY KEY(컬럼명1, 컬럼명2, ...)
    -> );
</pre>
<pre>
컬럼명1, 컬럼명2, ... : PRIMARY KEY 로 지정할 컬럼명을 넣음 (한 개 이상을 지정할 수 있음, 보통은 한 개를 지정함)
         PRIMARY KEY 로 지정할 컬럼은 NULL 값을 등록할 수 없어야 하고, 컬럼 안에서 같은 값이 없도록 각 값이 유일해야 함
         따라서, 해당 컬럼은 보통 NOT NULL(NULL 값 방지) AUTO_INCREMENT(유일함) 선언이 되어 있는 경우가 많음
</pre>
<pre>
예)
CREATE TABLE mytable (
  id INT UNSIGNED NOT NULL AUTO_INCREMENT,
  name VARCHAR(50) NOT NULL,
  modelnumber VARCHAR(15) NOT NULL,
  series VARCHAR(30) NOT NULL,
  PRIMARY KEY(id)
);
</pre>

<div class="alert alert-block alert-success">
<font color="blue" size="4em">실습5 - 테이블 생성</font>
<pre>

1. 데이터베이스 만들기: 이름 customer_db
2. 테이블 만들기
<img src="https://www.fun-coding.org/00_Images/table_ex.png" />
3. 테이블 잘못만들어졌으면 DROP TABLE [IF EXISTS] dbname; 로 테이블 삭제 후 재생성
</pre>
</div>

<pre>
CREATE DATABASE customer_db;
USE customer_db;

CREATE TABLE mytable (
    no INT UNSIGNED NOT NULL AUTO_INCREMENT,
    name CHAR(20) NOT NULL,
    age TINYINT,
    phone VARCHAR(20),
    email VARCHAR(30) NOT NULL,
    address VARCHAR(50),
    PRIMARY KEY(id)
);
</pre>

#### 3.2.1 테이블 조회
- 기본 문법 (SHOW TABLES)
<pre>
mysql> SHOW TABLES;
+----------------+
| Tables_in_dave |
+----------------+
| mytable        |
+----------------+
1 row in set (0.00 sec)
</pre>

- 기본 문법 (DESC 테이블명)

<pre>
mysql> desc mytable;
+-------------+------------------+------+-----+---------+----------------+
| Field       | Type             | Null | Key | Default | Extra          |
+-------------+------------------+------+-----+---------+----------------+
| id          | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| name        | varchar(50)      | NO   |     | NULL    |                |
| modelnumber | varchar(15)      | NO   |     | NULL    |                |
| series      | varchar(30)      | NO   |     | NULL    |                |
+-------------+------------------+------+-----+---------+----------------+
4 rows in set (0.00 sec)
</pre>

#### 3.2.2 테이블 삭제
- 기본 문법 (DROP TABLE 테이블명)
<pre>
mysql> DROP TABLE [IF EXISTS] 테이블명;
</pre>

IF EXISTS 옵션은 해당 데이타베이스 이름이 없더라도 오류를 발생시키지 말라는 의미

#### 3.2.3 테이블 구조 수정

- 테이블에 새로운 컬럼 추가
<pre>
문법: ALTER TABLE [테이블명] ADD COLUMN [추가할 컬럼명][추가할 컬럼 데이터형] 
mysql> ALTER TABLE mytable ADD COLUMN model_type varchar(10) NOT NULL;
</pre>

- 테이블 컬럼 타입 변경<br>
<pre>
문법: ALTER TABLE [테이블명] MODIFY COLUMN [변경할 컬럼명][변경할 컬럼 타입]
mysql>ALTER TABLE mytable MODIFY COLUMN name varchar(20) NOT NULL; 
</pre>

- 테이블 컬럼 이름 변경<br>
<pre>
문법: ALTER TABLE [테이블명] CHANGE COLUMN [기존 컬럼 명][변경할 컬럼 명][변경할 컬럼 타입]
mysql>ALTER TABLE mytable CHANGE COLUMN modelnumber model_num varchar(10) NOT NULL;
</pre>

- 테이블 컬럼 삭제<br>
<pre>
문법: ALTER TABLE [테이블명] DROP COLUMN [삭제할 컬럼 명]
mysql>ALTER TABLE mytable DROP COLUMN series;
</pre>

<div class="alert alert-block alert-warning">
<font color="blue" size="4em">실습5 - 테이블 생성, 조회</font><br>
<pre>
mysql> CREATE DATABASE dave;
mysql> USE dave;
mysql> CREATE TABLE mytable (
    ->   id INT UNSIGNED NOT NULL AUTO_INCREMENT,
    ->   name VARCHAR(50) NOT NULL,
    ->   modelnumber VARCHAR(15) NOT NULL,
    ->   series VARCHAR(30) NOT NULL,
    ->   PRIMARY KEY(id)
    -> );
mysql> SHOW TABLES;
+----------------+
| Tables_in_dave |
+----------------+
| mytable        |
+----------------+
1 row in set (0.00 sec)
mysql> desc mytable;
+-------------+------------------+------+-----+---------+----------------+
| Field       | Type             | Null | Key | Default | Extra          |
+-------------+------------------+------+-----+---------+----------------+
| id          | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| name        | varchar(50)      | NO   |     | NULL    |                |
| modelnumber | varchar(15)      | NO   |     | NULL    |                |
| series      | varchar(30)      | NO   |     | NULL    |                |
+-------------+------------------+------+-----+---------+----------------+
4 rows in set (0.00 sec)
</pre>

<b>연습문제1: 다음과 같이 보이도록 테이블 컬럼을 수정하시오</b>
<pre>
mysql> desc mytable;
+------------+------------------+------+-----+---------+----------------+
| Field      | Type             | Null | Key | Default | Extra          |
+------------+------------------+------+-----+---------+----------------+
| id         | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| name       | varchar(20)      | NO   |     | NULL    |                |
| model_num  | varchar(10)      | NO   |     | NULL    |                |
| model_type | varchar(10)      | NO   |     | NULL    |                |
+------------+------------------+------+-----+---------+----------------+
</pre>

<b>연습문제2 - 위 테이블을 삭제한 후, 연습문제1과 같은 컬럼을 가진 테이블을 생성하시오 (테이블명은 model_info 로 하시오)</b>
</div>

<pre>
CREATE TABLE mytable (
       id INT UNSIGNED NOT NULL AUTO_INCREMENT,
       name VARCHAR(50) NOT NULL,
       modelnumber VARCHAR(15) NOT NULL,
       series VARCHAR(30) NOT NULL,
       PRIMARY KEY(id)
);

ALTER TABLE mytable MODIFY COLUMN name varchar(20) NOT NULL;
ALTER TABLE mytable CHANGE COLUMN modelnumber model_num varchar(10) NOT NULL;
ALTER TABLE mytable CHANGE COLUMN series model_type varchar(10) NOT NULL;
</pre>

## 4. SQL DML(Data Manipulation Language) 이해 및 실습 (focusing on CRUD)

 ### 4.1. CRUD [Create(생성), Read(읽기), Update(갱신), Delete(삭제)]
 
 - 데이터 관리는 결국 데이터 생성, 읽기(검색), 수정(갱신), 삭제 를 한다는 의미

#### 4.1.1 데이터 생성 
- 테이블에 컬럼에 맞추어 데이터를 넣는 작업
- 기본 문법 (INSERT)

  1. 테이블 전체 컬럼에 대응하는 값을 모두 넣기
<pre>
    mysql> INSERT INTO 테이블명 VALUES(값1, 값2, ...);
</pre>

  2. 테이블 특정 컬럼에 대응하는 값만 넣기 (지정되지 않은 컬럼은 디폴트값 또는 NULL값이 들어감)
<pre>
    mysql> INSERT INTO 테이블명 (col1, col2, ...) VALUES(값1, 값2, ...);
</pre>

<pre>
예)
# mysql -u root -p
mysql> show databases;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| dave               |
| mysql              |
| performance_schema |
| sys                |
+--------------------+
mysql> use dave;
mysql> show tables;
+----------------+
| Tables_in_dave |
+----------------+
| mytable        |
+----------------+

mysql> desc mytable;
+------------+------------------+------+-----+---------+----------------+
| Field      | Type             | Null | Key | Default | Extra          |
+------------+------------------+------+-----+---------+----------------+
| id         | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| name       | varchar(20)      | NO   |     | NULL    |                |
| model_num  | varchar(10)      | NO   |     | NULL    |                |
| model_type | varchar(10)      | NO   |     | NULL    |                |
+------------+------------------+------+-----+---------+----------------+
</pre>

<b><font color="blue">mysql> INSERT INTO mytable VALUES(1, 'i7', '7700', 'Kaby Lake');</font></b>
<pre>
Query OK, 1 row affected (0.01 sec)

mysql> SELECT * FROM mytable;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  1 | i7   | 7700      | Kaby Lake  |
+----+------+-----------+------------+
1 row in set (0.00 sec)
</pre>

<b><font color="blue">mysql> INSERT INTO mytable (name, model_num, model_type) VALUES('i7', '7700K', 'Kaby Lake');</font></b>
<pre>
Query OK, 1 row affected (0.01 sec)

mysql> SELECT * FROM mytable;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  1 | i7   | 7700      | Kaby Lake  |
|  2 | i7   | 7700K     | Kaby Lake  |
+----+------+-----------+------------+
2 rows in set (0.00 sec)
</pre>

<div class="alert alert-block alert-warning">
<font color="blue" size="4em">실습 - 데이터 생성(입력), 검색</font><br>
웹페이지(http://www.enuri.com/list.jsp?cate=070701) 에서 1위 ~ 5위까지 데이터 입력하기<br>
<br>
- id는 자동 증가<br>
- name 은 코어 이름 <br>
- model_num 은 코어 모델 번호 <br>
- model_type 은 코드명 (카비레이크 -> Kaby Lake, 스카이레이크 -> Sky Lake 로 영문으로 작성)<br>
<br>
- 예: 코어 i7 7700 카비레이크<br>
-> name 은 i7<br>
-> model_num 은 7700<br>
-> model_type 은 Kaby Lake
</div>

<pre>
INSERT INTO mytable (name, model_num, model_type) VALUES('i7', '7700', 'Kaby Lake');
INSERT INTO mytable (name, model_num, model_type) VALUES('i7', '7500', 'Kaby Lake');    
INSERT INTO mytable (name, model_num, model_type) VALUES('i7', '7700K', 'Kaby Lake');  
INSERT INTO mytable (name, model_num, model_type) VALUES('i7', 'G4600', 'Kaby Lake');  
INSERT INTO mytable (name, model_num, model_type) VALUES('i7', '7600', 'Kaby Lake');  
</pre>

#### 4.1.2 데이터 읽기(검색)
- 테이블에 저장된 데이터를 읽는 작업
- 데이터베이스는 대용량 데이터를 가정하므로, 대용량 데이터 중 특정한 조건에 맞는 데이터를 추출하는 검색 작업이라고 하는 편이 보다 적합함
- 기본 문법 (SELECT)

  1. 테이블 전체 컬럼의 데이터 모두 읽기
<pre>
    mysql> SELECT * FROM 테이블명;
</pre>

  2. 테이블 특정 컬럼의 데이터만 읽기
<pre>
    mysql> SELECT 컬럼1, 컬럼2, ... FROM 테이블명;
</pre>
<pre>
mysql> SELECT name, model_num FROM mytable;
+------+-----------+
| name | model_num |
+------+-----------+
| i7   | 7700      |
| i7   | 7700K     |
+------+-----------+
</pre>

  3. 테이블 특정 컬럼의 데이터를 검색하되, 표시할 컬럼명도 다르게 하기 
<pre>
    mysql> SELECT 컬럼1 AS 바꿀컬럼이름, 컬럼2 AS 바꿀컬럼이름 FROM 테이블명;
</pre>
<pre>
예)
mysql> SELECT name AS cpu_name, model_num AS cpu_num FROM mytable;
+----------+---------+
| cpu_name | cpu_num |
+----------+---------+
| i7       | 7700    |
| i7       | 7700K   |
+----------+---------+
</pre>

  4. 데이터 정렬해서 읽기
     - ORDER BY 정렬할 기준 컬럼명 DESC|ASC
     - DESC는 내림차순 ASC는 오름차순
<pre>
mysql> SELECT * FROM 테이블명 ORDER BY 정렬할기준컬럼명 DESC;
</pre>
<pre>
mysql> SELECT 컬럼1, 컬럼2 FROM 테이블명 ORDER BY 정렬할기준컬럼명 ASC;
</pre>
<pre>
예)
mysql> SELECT * FROM mytable ORDER BY id DESC;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  2 | i7   | 7700K     | Kaby Lake  |
|  1 | i7   | 7700      | Kaby Lake  |
+----+------+-----------+------------+
2 rows in set (0.01 sec)
</pre>
<pre>
mysql> SELECT * FROM mytable ORDER BY id ASC;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  1 | i7   | 7700      | Kaby Lake  |
|  2 | i7   | 7700K     | Kaby Lake  |
+----+------+-----------+------------+
2 rows in set (0.00 sec)
</pre>

  5. 조건에 맞는 데이터만 검색하기 (비교)
     - WHERE 조건문 으로 조건 검색
     - 예) WHERE 컬럼명 < 값
     - 예) WHERE 컬럼명 > 값
     - 예) WHERE 컬럼명 = 값
<pre>
SELECT * FROM 테이블명 WHERE 필드명 = '값'
</pre>
<pre>
예)
mysql> SELECT * FROM mytable WHERE id < 2;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  1 | i7   | 7700      | Kaby Lake  |
+----+------+-----------+------------+
1 row in set (0.00 sec)
mysql> SELECT * FROM mytable WHERE id = 1;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  1 | i7   | 7700      | Kaby Lake  |
+----+------+-----------+------------+
1 row in set (0.00 sec)
mysql> SELECT * FROM mytable WHERE id > 1;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  2 | i7   | 7700K     | Kaby Lake  |
+----+------+-----------+------------+
</pre>

  6. 조건에 맞는 데이터만 검색하기 (논리 연산자)
     - WHERE 조건문 으로 조건 검색
     - 논리 연산자 활용
     - 예) WHERE 컬럼명 < 값 OR 컬럼명 > 값
     - 예) WHERE 컬럼명 > 값 AND 컬럼명 < 값
<pre>
SELECT * FROM 테이블명 WHERE (필드명='값') OR ( 필드명 ='값');
</pre>
<pre>
SELECT * FROM 테이블명 WHERE (필드명='값') AND ( 필드명 ='값');
</pre>
<pre>
예)
mysql> SELECT * FROM mytable WHERE id > 0 OR id < 2;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  1 | i7   | 7700      | Kaby Lake  |
|  2 | i7   | 7700K     | Kaby Lake  |
+----+------+-----------+------------+
2 rows in set (0.00 sec)
mysql> SELECT * FROM mytable WHERE id = 1 AND name = 'i7';
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  1 | i7   | 7700      | Kaby Lake  |
+----+------+-----------+------------+
1 row in set (0.00 sec)
</pre>

  7. 조건에 맞는 데이터만 검색하기 (LIKE 를 활용한 부분 일치)
     - WHERE 조건문 으로 조건 검색
     - LIKE  활용
     - 예) 홍으로 시작되는 값을 모두 찾을 경우
<pre>
SELECT * FROM 테이블명 WHERE 필드명 LIKE '홍%';
</pre>
     - 예) 홍이 들어간 값을 모두 찾을 경우
<pre>
SELECT * FROM 테이블명 WHERE 필드명 LIKE '%홍%';
</pre>
     - 예) 홍으로 시작되고 뒤에 2글자가 붙을 경우
<pre>
SELECT * FROM 테이블명 WHERE 필드명 LIKE '홍__';
</pre>
<pre>
예)
mysql> SELECT * FROM mytable WHERE name LIKE 'i%';
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  1 | i7   | 7700      | Kaby Lake  |
|  2 | i7   | 7700K     | Kaby Lake  |
+----+------+-----------+------------+
2 rows in set (0.00 sec)
mysql> SELECT * FROM mytable WHERE name LIKE 'i__';
Empty set (0.00 sec)
</pre>

  8. 결과중 일부만 데이터 가져오기 (LIMIT 을 활용)
     - LIMIT  활용
     - 예) 결과중 처음부터 10개만 가져오기
<pre>
SELECT * FROM 필드명 LIMIT 10;
</pre>
     - 예) 결과중 100번째부터, 10개만 가져오기
<pre>
SELECT * FROM 필드명 LIMIT 100, 10;
</pre>
<pre>
예)
mysql> SELECT * FROM mytable LIMIT 1;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  1 | i7   | 7700      | Kaby Lake  |
+----+------+-----------+------------+
1 row in set (0.00 sec)
mysql> SELECT * FROM mytable LIMIT 1, 1;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  2 | i7   | 7700K     | Kaby Lake  |
+----+------+-----------+------------+
1 row in set (0.00 sec)
</pre>

  9. 조건 조합
     - 위에서 나열한 조건을 조합해서 다양한 Query를 작성할 수 있음
     - 조합 순서 SELECT FROM WHERE ORDER BY LIMIT

<pre>
예)
mysql> SELECT id, name FROM mytable
->  WHERE id < 4 AND name LIKE '%i%'
-> ORDER BY name DESC
-> LIMIT 2;
</pre>

<div class="alert alert-block alert-warning">
<font color="blue" size="4em">실습 - 데이터 검색</font><br>

- 연습문제1: model_num 이 7700 으로 시작하는 로우(Row) 검색하기<br>
- 연습문제2: name 이 i7 인 로우(Row) 검색하기<br>
- 연습문제3: model_type 이 카비레이크 인 로우(Row) 를 1개만 검색하기(LIMIT 사용)
</div>

<pre>
SELECT * FROM mytable WHERE model_num LIKE '7700%'
SELECT * FROM mytable WHERE name LIKE '%i7%'
SELECT * FROM mytable WHERE model_type LIKE '%카바레이크%' LIMIT 1
</pre>

#### 4.1.3 데이터 수정
- 테이블에 저장된 데이터를 수정하는 작업
- 기본 문법 (UPDATE)

  1. 보통 WHERE 조건문과 함께 쓰여서, 특정한 조건에 맞는 데이터만 수정하는 경우가 많음
<pre>
    mysql> UPDATE 테이블명 SET 수정하고 싶은 컬럼명 = '수정하고 싶은 값' WHERE 특정 컬럼 = '값';
</pre>

  2. 다수의 컬럼 값을 수정할 수도 있음
<pre>
    mysql> UPDATE 테이블명 SET 수정하고 싶은 컬럼명1 = '수정하고 싶은 값', 수정하고 싶은 컬럼명2 = '수정하고 싶은 값', 수정하고 싶은 컬럼명3 = '수정하고 싶은 값' WHERE 특정 컬럼 < '값';
</pre>
<pre>
예)
mysql> SELECT * FROM mytable;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  3 | i7   | 7700      | Kaby Lake  |
+----+------+-----------+------------+
mysql> UPDATE mytable SET name = 'i5', model_num = '5500' WHERE id = 3;
mysql> SELECT * FROM mytable;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  3 | i5   | 5500      | Kaby Lake  |
+----+------+-----------+------------+
</pre>

#### 4.1.4 데이터 삭제
- 테이블에 저장된 데이터를 삭제하는 작업
- 기본 문법 (DELETE)

  1. 보통 WHERE 조건문과 함께 쓰여서, 특정한 조건에 맞는 데이터만 삭제하는 경우가 많음
<pre>
    mysql> DELETE FROM 테이블명 WHERE 특정 컬럼 = '값';
</pre>

  2. 테이블에 저장된 모든 데이터를 삭제할 수도 있음
<pre>
    mysql> DELETE FROM 테이블명;
</pre>
<pre>
예)
mysql> SELECT * FROM mytable;
+----+------+-----------+------------+
| id | name | model_num | model_type |
+----+------+-----------+------------+
|  3 | i5   | 5500      | Kaby Lake  |
+----+------+-----------+------------+
1 row in set (0.00 sec)
mysql> DELETE FROM mytable WHERE id = 3;
Query OK, 1 row affected (0.01 sec)
mysql> SELECT * FROM mytable;
Empty set (0.00 sec)
</pre>

<div class="alert alert-block alert-warning">
<font color="blue" size="4em">실습 - 테이블 수정, 데이터 수정, 검색</font><br>

사전조건: 이미 테이블에는 웹페이지(http://www.enuri.com/list.jsp?cate=070701) 에서 1위 ~ 5위까지 데이터가 입력되어 있어야 함<br>
<br>
1. lowest_price(컬럼명) INT UNSIGNED(데이터타입) 으로 컬럼 추가<br>
2. 최종 다음과 같은 모습으로 mytable 구조가 되어야 함<br>
<pre>
mysql> desc mytable;
+--------------+------------------+------+-----+---------+----------------+
| Field        | Type             | Null | Key | Default | Extra          |
+--------------+------------------+------+-----+---------+----------------+
| id           | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| name         | varchar(20)      | NO   |     | NULL    |                |
| model_num    | varchar(10)      | NO   |     | NULL    |                |
| model_type   | varchar(10)      | NO   |     | NULL    |                |
| lowest_price | int(10) unsigned | YES  |     | NULL    |                |
+--------------+------------------+------+-----+---------+----------------+
</pre>
3. 웹페이지(http://www.enuri.com/list.jsp?cate=070701) 에서 1위 ~ 5위까지 lowest_price 값 수정하기<br>
   - lowest_price 값은 정품 최저 가격으로 입력하기 <br>
   - 예: 222,180원 -> 222180<br>
<br>
- 연습문제1: lowest_price 이 300000 이하인 로우(Row) 중에서 name과 model_num만 검색하기<br>
  . 이하는 같거나, 작은 값을 의미하고, 조건으로는 <= 와 같이 작성한다.<br>
  <br>
- 연습문제2: lowest_price 이 400000 이상인 로우(Row) 만 검색하기<br>
  . 이상은 같거나, 큰 값을 의미하고, 조건으로는 >= 와 같이 작성한다.
</div>

<pre>
ALTER TABLE mytable ADD COLUMN lowest_price INT UNSIGNED;

UPDATE mytable SET lowest_price = 347100 WHERE id = 1;
...

SELECT name, model_num FROM mytable WHERE lowest_price < 300000;
</pre>

## 5. SQL DCL(Data Control Language) 이해 및 실습

### 5.1. mysql 사용자 확인, 추가, 비밀번호 변경, 삭제

<pre>
1. mysql 사용자 확인
# mysql -u root -p
mysql> use mysql;
mysql> select * from user;

2. 사용자 추가
# mysql -u root -p
mysql> use mysql;

1) 로컬에서만 접속 가능한 userid 생성
mysql> create user 'userid'@localhost identified by '비밀번호';

2) 모든 호스트에서 접속 가능한 userid 생성
mysql> create user 'userid'@'%' identified by '비밀번호';

3. 사용자 비밀번호 변경
mysql> SET PASSWORD FOR 'userid'@'%' = '신규비밀번호';

4. 사용자 삭제
# mysql -u root -p
mysql> use mysql;
mysql> drop user 'userid'@'%';
</pre>

<div class="alert alert-block alert-success">
<font color="blue" size="4em">실습 - 사용자 확인, 추가, 비밀번호 변경, 삭제</font>
<pre>
# mysql -u root -p
mysql> use mysql;
mysql> create user '만들고싶은ID'@'%' identified by '비밀번호';
mysql> select host, user from user;
mysql> SET PASSWORD FOR '만들고싶은ID'@'%' = '신규비밀번호';
mysql> exit;
</pre>
<pre>
# mysql -u 만들고싶은ID -p
mysql> exit;
</pre>
<pre>
# mysql -u root -p
mysql> use mysql;
mysql> drop user '만들고싶은ID'@'%';
mysql> select host, user from user;
mysql> exit;
</pre>
<pre>
# mysql -u 만들고싶은ID -p
에러가 나와야 함
</pre>

### 5.2. mysql 접속 허용 관련 설정

<pre>
1) 현재 부여된 권한 확인하기
mysql> SHOW GRANTS for 아이디;
예) SHOW GRANTS for 'davelee'@'%'

2) 로컬에서만 접속 허용
mysql> GRANT ALL ON DATABASE.TABLE to 'root'@localhost;

3) 특정 권한만 허용
mysql> GRANT SELECT, UPDATE ON DATABASE.TABLE to 'root'@localhost;


옵션 상세
(1) ALL – 모든 권한 / SELECT, UPDATE – 조회, 수정 권한등으로 권한 제한 가능
    예) GRANT INSERT,UPDATE,SELECT ON *.* TO 'username'@'localhost';
(2) DATABASE.TABLE – 특정 데이터베이스에 특정 테이블에만 권한을 줄 수 있음 / *.* – 모든 데이터베이스에 모든 테이블 권한을 가짐
(3) root – 계정명
(4) korea123 – 계정 비밀번호
</pre>

## 6. pymysql 모듈 이해 및 실습

### 6.1 pymysql 라이브러리 소개 및 설치
* mysql을 python에서 사용할 수 있는 라이브러리 (pymysql 라이브러리 이외에도 MySQLdb(Mysql-pytion), MySQL connector 등 다양한 라이브러리 존재)
* 이 중에서 설치가 가장 쉬운 라이브러리
* 설치
  - pip install PyMySQL
  
* 일반적인 mysql 핸들링 코드 작성 순서
  1. PyMySql 모듈 import
  2. pymysql.connect() 메소드를 사용하여 MySQL에 연결
     - 호스트명, 포트, 로그인, 암호, 접속할 DB 등을 파라미터로 지정
  3. MySQL 접속이 성공하면, Connection 객체로부터 cursor() 메서드를 호출하여 Cursor 객체를 가져옴
  4. Cursor 객체의 execute() 메서드를 사용하여 SQL 문장을 DB 서버에 전송
  5. SQL 쿼리의 경우 Cursor 객체의 fetchall(), fetchone(), fetchmany() 등의 메서드를 사용하여 서버로부터 가져온 데이타를 코드에서 활용
  6. 삽입, 갱신, 삭제 등의 DML(Data Manipulation Language) 문장을 실행하는 경우, INSERT/UPDATE/DELETE 후 Connection 객체의 commit() 메서드를 사용하여 데이타를 확정
  7. Connection 객체의 close() 메서드를 사용하여 DB 연결을 닫음

* PyMySql 모듈 import

In [14]:
import pymysql

* pymysql.connect() 메소드를 사용하여 MySQL에 연결
     - 호스트명, 포트, 로그인, 암호, 접속할 DB 등을 파라미터로 지정
     - 주요 파라미터
       - host : 접속할 mysql server 주소
       - port : 접속할 mysql server 의 포트 번호
       - user : mysql ID
       - passwd : mysql ID의 암호
       - db : 접속할 데이터베이스
       - charset='utf8' : mysql에서 select하여 데이타를 가져올 때 한글이 깨질 수 있으므로 연결 설정에 넣어줌

In [15]:
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='funcoding', db='ecommerce', charset='utf8')

In [16]:
db

  3. MySQL 접속이 성공하면, Connection 객체로부터 cursor() 메서드를 호출하여 Cursor 객체를 가져옴
  4. Cursor 객체의 execute() 메서드를 사용하여 SQL 문장을 DB 서버에 전송

* 테이블 생성
  - Cursor Object 가져오기: cursor = db.cursor()  
  - SQL 실행하기: cursor.execute(SQL)
  - 실행 mysql 서버에 확정 반영하기: db.commit()

In [17]:
ecommerce = db.cursor()

In [18]:
ecommerce

* cursor 는 control structure of database 입니다. (연결된 객체로 보셔도 좋습니다.)

In [20]:
sql = """
    CREATE TABLE product (
        PRODUCT_CODE VARCHAR(20) NOT NULL,
        TITLE VARCHAR(200) NOT NULL,
        ORI_PRICE INT,
        DISCOUNT_PRICE INT,
        DISCOUNT_PERCENT INT,
        DELIVERY VARCHAR(2),
        PRIMARY KEY(PRODUCT_CODE)
    );
"""

* SQL 실행 (Cursor 객체의 execute() 메서드를 사용하여 INSERT, UPDATE 혹은 DELETE 문장을 DB 서버에 보냄)

In [21]:
ecommerce.execute(sql)

0

* 삽입, 갱신, 삭제 등이 모두 끝났으면 Connection 객체의 commit() 메서드를 사용하여 데이타를 Commit

In [26]:
db.commit()

* Connection 객체의 close() 메서드를 사용하여 DB 연결을 닫음

In [27]:
db.close()

### 패턴으로 익히는 pymysql

In [38]:
# 1. 라이브러리 가져오기
import pymysql

# 2. 접속하기
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='funcoding', db='ecommerce', charset='utf8')

# 3. 커서 가져오기
cursor = db.cursor()

# 4. SQL 구문 만들기 (CRUD SQL 구문 등)
sql = '''
    CREATE TABLE product (
        PRODUCT_CODE VARCHAR(20) NOT NULL,
        TITLE VARCHAR(200) NOT NULL,
        ORI_PRICE INT,
        DISCOUNT_PRICE INT,
        DISCOUNT_PERCENT INT,
        DELIVERY VARCHAR(2),
        PRIMARY KEY(PRODUCT_CODE)
    );
'''

# 5. SQL 구문 실행하기
cursor.execute(sql)

# 6. DB에 Complete 하기
db.commit()

# 7. DB 연결 닫기
db.close()

* 데이터 삽입(INSERT)
  - Cursor Object 가져오기: cursor = db.cursor()  
  - SQL 실행하기: cursor.execute(SQL)
  - 실행 mysql 서버에 확정 반영하기: db.commit()

In [47]:
import pymysql

db = pymysql.connect(host='127.0.0.1', port=3306, user='root', passwd='funcoding', db='ecommerce', charset='utf8')

cursor = db.cursor()

for index in range(10):
    product_code = 215673140 + index + 1
    sql = """INSERT INTO product VALUES(
    '""" + str(product_code) + """', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'); """
    print (sql)
    cursor.execute(sql)

db.commit()
db.close()

INSERT INTO product VALUES(
    '215673141', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673142', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673143', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673144', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673145', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673146', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673147', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673148', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673149', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673150', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');

* 데이터 조회(SELECT)
  - Cursor Object 가져오기: cursor = db.cursor()  
  - SQL 실행하기: cursor.execute(SQL)
  - mysql 서버로부터 데이터 가져오기: fetch 메서드 사용
    - fetchall(): Fetch all the rows
    - fetchmany(size=None): Fetch several rows
    - fetchone(): Fetch the next row

In [42]:
data = ((1, 2, 3, 4), (5, 6, 7, 8))
for item in data:
    print (item[1])

2
6

In [50]:
import pymysql

db = pymysql.connect(host='localhost', port=3306, user='root', passwd='funcoding', db='ecommerce', charset='utf8')
cursor = db.cursor()
sql = "SELECT * FROM product"
cursor.execute(sql)
result = cursor.fetchone()
print(record)
db.close()

('215673142', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F')

* 데이터 수정(UPDATE)
  - Cursor Object 가져오기: cursor = db.cursor()  
  - SQL 실행하기: cursor.execute(SQL)
  - 실행 mysql 서버에 확정 반영하기: db.commit()

In [ ]:
달리샵린넨원피스 뷔스티에 썸머 가디건 코디전
33,000원
9,900원
70

UPDATE product SET 
    TITLE='달리샵린넨원피스 뷔스티에 썸머 가디건 코디전', 
    ORI_PRICE=33000, 
    DISCOUNT_PRICE=9900, 
    DISCOUNT_PERCENT=70 
    WHERE PRODUCT_CODE='215673141'

1. 라이브러리 가져오기

In [1]:
# 1. 라이브러리 가져오기
import pymysql

# 2. 접속하기
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='funcoding', db='ecommerce', charset='utf8')

# 3. 커서 가져오기
cursor = db.cursor()

# 4. SQL 구문 만들기
SQL = """
UPDATE product SET 
    TITLE='달리샵린넨원피스 뷔스티에 썸머 가디건 코디전', 
    ORI_PRICE=33000, 
    DISCOUNT_PRICE=9900, 
    DISCOUNT_PERCENT=70 
    WHERE PRODUCT_CODE='215673141'
"""

# 5. SQL 구문 실행하기
cursor.execute(SQL)

# 6. commit 하기
db.commit()

# 7. close 하기
db.close()

* 데이터 삭제(DELETE)
  - Cursor Object 가져오기: cursor = db.cursor()  
  - SQL 실행하기: cursor.execute(SQL)
  - 실행 mysql 서버에 확정 반영하기: db.commit()

In [ ]:
DELETE FROM product WHERE PRODUCT_CODE='215673142'

In [2]:
import pymysql

db = pymysql.connect(host='localhost', port=3306, user='root', passwd='funcoding', db='ecommerce', charset='utf8')

cursor = db.cursor()

SQL = """DELETE FROM product WHERE PRODUCT_CODE='215673142'"""

cursor.execute(SQL)

db.commit()

db.close()

<div class="alert alert-block alert-warning">
<font color="blue" size="4em">연습문제</font><br>
* 위 pymysql 샘플코드를 참고해서 다음과 깉이 작업하기<br>
<br>
웹페이지(http://www.enuri.com/list.jsp?cate=070701) 에서 1위 ~ 10위까지 데이터 입력하기<br>
<br>
- id는 자동 증가<br>
- name 은 코어 이름 <br>
- model_num 은 코어 모델 번호 <br>
- model_type 은 코드명 (카비레이크, 스카이레이크 로 작성)<br>
<br>
- 예: 코어 i7 7700 카비레이크<br>
-> name 은 i7<br>
-> model_num 은 7700<br>
-> model_type 은 카비레이크
</div>